---
kind: type
id: T:Autodesk.Revit.DB.ArrayAnchorMember
source: html/4e138a54-bc03-a66f-831b-7ab88f15677e.htm
---
# Autodesk.Revit.DB.ArrayAnchorMember

Represents the possible choices for how the translation or rotation is used to place each member of the array.

## Syntax (C#)
```csharp
public enum ArrayAnchorMember
```